Repository: atl4sss/MyScanApp
Catalog: lib/l10n/app_*.arb
Languages: ru

# homeSelectModality
source: Choose imaging modality:
ru: Выберите вид томографии:

# homeDescriptionPrefix
source: Our program detects most diseases with up to 97% accuracy. Read more about the spectrum of diseases
ru: Наша программа определит большинство заболеваний с точностью до 97%. Подробнее о спектре заболеваний можно узнать

# homeDescriptionLink
source: here
ru: здесь

# homeLungs
source: Lung CT
ru: КТ лёгких

# homeOct
source: Eye OCT
ru: ОКТ глаза

# homeBrain
source: Brain MRI
ru: МРТ мозга

# modalityLungsTitle
source: Lung CT scan
ru: Компьютерная томография лёгких

# modalityLungsHintPrefix
source: How to photograph correctly — see
ru: Как правильно фотографировать — смотрите

# modalityLungsHintLink
source: here
ru: здесь

# modalityOctTitle
source: Eye OCT
ru: ОКТ глаза

# modalityOctHintPrefix
source: Shooting recommendations are available
ru: Рекомендации по съёмке доступны

# modalityOctHintLink
source: here
ru: здесь

# modalityBrainTitle
source: Brain MRI
ru: МРТ мозга

# modalityBrainHintPrefix
source: Instructions for a quality image —
ru: Инструкции по качественному снимку —

# modalityBrainHintLink
source: here
ru: здесь

# attachPhotoTitle
source: Attach a photo:
ru: Прикрепите фотографию:

# analyzeButton
source: Analyze
ru: Анализ

# analysisError
source: Analysis error: {error}
ru: Ошибка анализа: {error}

# resultTitle
source: Analysis result
ru: Результат анализа

# backButton
source: Go back
ru: Вернуться назад

# pillRisks
source: Risks
ru: Риски

# pillPrevention
source: Prevention
ru: Профилактика

# pillContact
source: Contact a doctor
ru: Связаться с врачом

# pillCauses
source: Causes
ru: Причины

# infoUnavailable
source: Information is not available yet.
ru: Информация пока недоступна.

# diagPneumoniaBrief
source: Pneumonia is an acute inflammation of lung tissue, most often caused by bacteria or viruses. Severity depends on the pathogen type, patient age, and comorbidities.
ru: Пневмония — острое воспаление лёгочной ткани, чаще всего вызванное бактериями или вирусами. Тяжесть течения зависит от вида возбудителя, возраста пациента и сопутствующих заболеваний.

# diagPneumoniaRisks
source: • Acute complications: pleurisy, lung abscess, sepsis. • Possible chronic outcomes: decreased lung function, bronchiectasis. • Especially dangerous for children under 5, the elderly, and immunocompromised people.
ru: • Острые осложнения: плеврит, абсцесс лёгкого, сепсис. • Возможны хронические последствия: снижение функции лёгких, формирование бронхоэктазов. • Особенно опасна для детей младше 5 лет, пожилых и лиц с иммунодефицитом.

# diagPneumoniaPrevention
source: • Vaccination (pneumococcal, influenza, COVID‑19). • Avoid smoking, maintain regular physical activity. • Timely treatment of colds and ENT infections.
ru: • Вакцинация (пневмококковая, против гриппа, COVID‑19). • Отказ от курения, регулярная физическая активность. • Своевременное лечение простудных и ЛОР‑инфекций.

# diagPneumoniaContact
source: Fever > 38 °C for more than 3 days, shortness of breath or chest pain — contact a therapist/pulmonologist. 📞 103 — emergency ambulance 📞 Ministry of Health hotline: 8 800 080 88 87
ru: Температура > 38 °C дольше 3 дней, одышка или боль в груди — обратитесь к терапевту/пульмонологу. 📞 103 — единый номер скорой помощи 📞 Горячая линия Минздрава РК: 8 800 080 88 87

# diagPneumoniaCauses
source: • Bacteria (most often Streptococcus pneumoniae, Haemophilus influenzae). • Viruses (influenza, SARS‑CoV‑2, etc.). • Atypical agents (Mycoplasma, Chlamydophila). • Aspiration of gastric contents.
ru: • Бактерии (чаще Streptococcus pneumoniae, Haemophilus influenzae). • Вирусы (грипп, SARS‑CoV‑2 и др.). • Атипичные агенты (Mycoplasma, Chlamydophila). • Аспирация желудочного содержимого.

# diagMeningiomaBrief
source: A meningioma is a benign tumor of the meninges; it grows slowly and is often found incidentally. It may cause headaches, seizures and focal neurological symptoms due to compression.
ru: Менингиома — доброкачественная опухоль мозговых оболочек, растёт медленно и нередко выявляется случайно. Может вызывать головные боли, судороги и очаговые неврологические симптомы за счёт сдавления тканей.

# diagMeningiomaRisks
source: • Brain structure compression → limb weakness, speech or vision problems. • Brain edema and raised intracranial pressure (headache, nausea, seizures). • Cranial nerve involvement in basal location. • Rare (< 2%) malignant transformation to atypical/anaplastic form.
ru: • Сдавление структур мозга → слабость конечностей, нарушение речи, зрения. • Отёк мозга и повышение внутричерепного давления (головная боль, тошнота, судороги). • Поражение черепных нервов при базальной локализации. • Редкая (< 2%) малигнизация до атипичной/анапластической формы.

# diagMeningiomaPrevention
source: No specific measures; however: • Minimize unnecessary radiation (CT without indication). • Manage hormone therapy with your doctor. • Maintain vascular/metabolic health. • Regular MRI screening for NF2 or prior head irradiation.
ru: Специфических мер нет, однако: • Минимизируйте ненужное рентген-/γ-излучение. • Контролируйте гормонотерапию с врачом. • Поддерживайте сосудистое и метаболическое здоровье. • Регулярные МР-скрининги при NF2 или облучении головы в анамнезе.

# diagMeningiomaContact
source: Consult a neurosurgeon/neurologist if you have: • Persistent progressive headaches. • New seizure episodes. • Visual/hearing disturbances or paresis. 📞 Republican Neurosurgery Center: +7 7172 62‑18‑27 📞 Emergency: 103
ru: Обратитесь к нейрохирургу/неврологу, если появились: • Стойкие прогрессирующие головные боли. • Новые судорожные приступы. • Нарушения зрения, слуха, парезы. 📞 Республиканский нейрохирургический центр: +7 7172 62‑18‑27 📞 Экстренная помощь: 103

# diagMeningiomaCauses
source: • Ionizing radiation — the most proven factor. • Genetic syndromes (NF2). • Hormonal influence: 2–3× more common in women. • Trauma and chronic inflammation are discussed but weakly proven. ⚠️ Most meningiomas are benign (Grade I) and slow-growing; management includes observation, microsurgery or radiosurgery.
ru: • Ионизирующее излучение — доказанный фактор риска. • Генетические синдромы (NF2). • Гормональное влияние: у женщин в 2–3 раза чаще. • Травмы и хроническое воспаление обсуждаются, но доказательств мало. ⚠️ В большинстве случаев менингиома доброкачественна (Grade I) и растёт медленно; тактика — наблюдение, хирургия или радиохирургия.

# infoTitle
source: Information board
ru: Информационная доска

# infoPrivacyTitle
source: Privacy
ru: Конф.

# infoPrivacyBody
source: Privacy We strictly follow principles of confidentiality and personal data protection. All data transferred through our platform — medical scans, reports, complaints, passwords and other user information — are stored in encrypted form and securely protected. Our system complies with current information security standards and the legislation of the Republic of Kazakhstan.
ru: Конфиденциальность Мы строго соблюдаем принципы конфиденциальности и защиты персональных данных. Все данные, передаваемые через нашу платформу, включая медицинские сканы, отчёты, жалобы, пароли и иную пользовательскую информацию, хранятся в зашифрованном виде и подлежат надёжной защите. Наша система соответствует действующим стандартам информационной безопасности и нормам законодательства Республики Казахстан.

# infoPhotoTitle
source: Photos
ru: Фото

# infoPhotoBody
source: For correct image processing and accurate diagnostics it is crucial to meet quality requirements. Please read the recommendations before uploading files. • Full frame coverage: the image must fully fit without cropped areas. • Lighting: take photos in good, even light. Avoid glare, shadows and overexposure. • File formats: PNG and JPEG (JPG) are supported.
ru: Для корректной обработки изображения и точной диагностики крайне важно соблюдать требования к качеству загружаемых снимков. Пожалуйста, ознакомьтесь с рекомендациями перед отправкой файлов. • Полный охват изображения: снимок должен полностью помещаться в кадре, без обрезанных участков. • Освещение: фотографируйте при хорошем, равномерном освещении. Избегайте бликов, теней и пересветов. • Формат файлов: поддерживаются PNG и JPEG (JPG).

# infoDiseasesTitle
source: Diseases
ru: Болезни

# infoDiseasesBody
source: Our system supports automatic recognition of a wide range of pathologies and conditions based on different medical images. The algorithms are validated against international standards and adapted to clinical practice. 1. Brain MRI: - Pituitary adenoma - Glioma - Meningioma - Normal 2. Eye OCT (retina): - Choroidal neovascularization (CNV) - Diabetic macular edema (DME) - Drusen (drusenoid dystrophy) - Normal 3. Chest CT (lungs): - Pneumonia - Tuberculosis - COVID‑19 - Normal We regularly update and expand the list of supported conditions based on new clinical data and global medical guidelines.
ru: Наша система поддерживает автоматическое распознавание широкого спектра патологий и состояний на основе различных медицинских изображений. Алгоритмы проходят валидацию по международным стандартам и адаптированы под клиническую практику. 1. МРТ головного мозга: - Аденома гипофиза - Глиома - Менингиома - Норма 2. ОСТ (оптическая когерентная томография) сетчатки глаза: - Хориоидальная неоваскуляризация (ХНВ) - Диабетический макулярный отёк (ДМО) - Друзенозная дистрофия (друзены) - Норма 3. КТ органов грудной клетки (лёгкие): - Пневмония - Туберкулёз - COVID‑19 - Норма Мы регулярно обновляем и расширяем перечень поддерживаемых состояний с учётом новых клинических данных и рекомендаций мировых медицинских сообществ.

# infoLimitationsTitle
source: Limitations
ru: Ограничения

# infoLimitationsBody
source: Despite high accuracy, our system has a number of technical and clinical limitations. We strive for the most correct interpretation; however: - Results are for reference only and do not replace an in‑person doctor consultation. - The system does not detect rare or atypical pathologies outside the supported list. - Low‑quality, artifact‑ridden or cropped photos may be misclassified or rejected. - Printed scans, screenshots or distorted images (glare, overlays) may lead to incorrect results. The user is responsible for the correctness of the uploaded image.
ru: Несмотря на высокую точность, наша система имеет ряд технических и клинических ограничений. Мы стремимся к максимально корректной интерпретации данных, однако: - Результаты носят справочный характер и не заменяют очную консультацию врача. - Система не распознаёт редкие или нетипичные патологии, не входящие в перечень поддерживаемых. - Фотографии низкого качества, с артефактами или обрезанные могут быть распознаны с ошибками или не обработаны вовсе. - Распечатанные снимки, скриншоты или изображения с искажениями (блики, наложения) могут привести к некорректным результатам. Пользователь несёт ответственность за корректность загружаемого изображения.

# infoFaqBody
source: Frequently Asked Questions (FAQ) - Can I upload photos from a phone? Yes, if quality requirements are met (see “Photos”). - Is the original scanner file required? No. A clear photo of the screen is acceptable if it is sharp, uncropped and without glare. - How long does analysis take? Usually from a few seconds to one minute depending on server load. - Can I use old scans? Yes, if they are of good quality and meet technical requirements. - What if I doubt the result? Consult a specialist. The system supports decision‑making, not final diagnosis.
ru: Часто задаваемые вопросы (FAQ) - Можно ли загружать фото с телефона? Да, при условии соблюдения требований к качеству снимка (см. раздел «Фото»). - Обязателен ли оригинальный файл с томографа? Нет. Пригодна и фотография экрана, если она чёткая, без обрезаний и бликов. - Сколько времени занимает анализ? Как правило, от нескольких секунд до минуты в зависимости от загрузки сервера. - Можно ли использовать старые снимки? Да, если они хорошего качества и соответствуют техническим требованиям. - Что делать, если результат вызывает сомнения? Обратитесь к профильному специалисту. Система предназначена для поддержки принятия решений, а не постановки диагноза.

# infoValidationTitle
source: Accuracy & validation
ru: Точность и валидация

# infoValidationBody
source: System accuracy is confirmed by a series of validation tests on representative datasets. We use advanced deep learning and computer vision methods repeatedly verified on clinical data. Individual models are developed for each pathology, trained on thousands of annotated images with certified physicians. Average sensitivity and specificity for major classes exceed 90%. Continuous model retraining and strict quality control ensure stability and reliability of results.
ru: Точность работы системы подтверждена серией валидационных испытаний на репрезентативных датасетах. Используются передовые методы глубинного обучения и компьютерного зрения, прошедшие многократную проверку на клинических данных. Для каждой патологии разрабатываются индивидуальные модели, обученные на тысячах размеченных изображений с участием сертифицированных врачей. Средняя чувствительность и специфичность по основным классам превышает 90%. Постоянное дообучение моделей и строгий контроль качества гарантируют стабильность и надёжность результатов.

# infoAboutTitle
source: About the system
ru: О системе

# infoAboutBody
source: Our platform is an intelligent clinical decision support system designed to analyse diagnostic images using artificial intelligence. The goal is to provide doctors and patients with a preliminary analysis tool that accelerates pathology detection and improves diagnostic accuracy. The system is adapted for various study types (MRI, CT, OCT) and can be used in clinical practice or personally.
ru: Наша платформа — это интеллектуальная система поддержки медицинских решений, разработанная для анализа диагностических изображений с применением искусственного интеллекта. Цель проекта — предоставить врачам и пациентам инструмент предварительного анализа изображений, способный ускорить выявление патологий и повысить точность диагностики. Система адаптирована под различные типы исследований (МРТ, КТ, ОСТ) и может использоваться как в клинической практике, так и для личного пользования.

# profileTitle
source: Profile
ru: Профиль

# profilePersonalDataTitle
source: Personal data
ru: Персональные данные

# profileMedicalInfoTitle
source: Medical information
ru: Медицинская информация

# profileStatsTitle
source: MyScan statistics
ru: Статистика MyScan

# profileInsuranceTitle
source: Insurance
ru: Страхование

# profileEmergencyContactsTitle
source: Emergency contacts
ru: Экстренные контакты

# profileHistoryButton
source: Scan history
ru: История сканов

# profileDOBLabel
source: Date of birth
ru: Дата рождения

# profileAgeLabel
source: Age
ru: Возраст

# profileGenderLabel
source: Gender
ru: Пол

# profileAddressLabel
source: Address
ru: Адрес

# profileClinicLabel
source: Assigned clinic
ru: Приписанная поликлиника

# profileDoctorLabel
source: Primary doctor
ru: Участковый врач

# profileBloodGroupLabel
source: Blood group
ru: Группа крови

# profileAllergiesLabel
source: Allergies
ru: Аллергии

# profileChronicDiseasesLabel
source: Chronic diseases
ru: Хронические заболевания

# profileLastCheckupLabel
source: Last check-up
ru: Последняя диспансеризация

# profilePolicyLabel
source: Policy
ru: Полис

# profileValidUntilLabel
source: Valid until
ru: Действителен до

# profileMotherLabel
source: Mother
ru: Мать

# profileFatherLabel
source: Father
ru: Отец

# profileNameValue
source: Alisher Omarov
ru: Омаров Алишер Нурланович

# profileDOBValue
source: 14 March 2006
ru: 14 марта 2006 г.

# profileAgeValue
source: 18 years
ru: 18 лет

# profileGenderValue
source: male
ru: мужской

# profileAddressValue
source: Almaty, Seifullin Ave. 215, apt. 48
ru: г. Алматы, пр. Сейфуллина 215, кв. 48

# profileClinicValue
source: City Polyclinic No. 12
ru: Городская поликлиника № 12

# profileDoctorValue
source: Turebaeva Zh. K. (therapist)
ru: Туребаева Ж. К. (терапевт)

# profileAllergiesValue
source: no data
ru: нет данных

# profileChronicDiseasesValue
source: bronchial asthma (mild, controlled)
ru: бронхиальная астма (лёгкая, под контролем)

# profileLastCheckupValue
source: 12 October 2024
ru: 12 октября 2024 г.

# profilePolicyValue
source: MedLife JSC No. B‑374‑221‑99
ru: АО «MedLife» № B‑374‑221‑99

# profilePolicyValidUntilValue
source: 31 December 2025
ru: 31 декабря 2025 г.

# profileMotherValue
source: Omarova Aizhan • +7 701 555 2244
ru: Омарова Айжан • +7 701 555 2244

# profileFatherValue
source: Omarov Nurlan • +7 701 888 1321
ru: Омаров Нурлан • +7 701 888 1321

# profileStatBrainMRI
source: Brain MRI
ru: МРТ головного мозга

# profileStatLungCT
source: Lung CT
ru: КТ лёгких

# profileStatRetinaOCT
source: Retina OCT
ru: ОСТ сетчатки

# reportsTitle
source: Generate report
ru: Оформить отчёт

# reportsSubtitle
source: AI will format your complaints, symptoms and images into a clear PDF for your doctor
ru: ИИ оформит ваши жалобы, симптомы и снимки в понятном, удобном для терапевта PDF‑формате

# reportsPickImageTitle
source: Choose an image:
ru: Выберите снимок:

# reportsComplaintsTitle
source: List your complaints:
ru: Выпишите ваши жалобы:

# reportsComplaintHint
source: Describe symptoms…
ru: Опишите симптомы…

# reportsSubmitButton
source: Generate
ru: Оформить

# reportsEmptyError
source: Please describe your symptoms
ru: Пожалуйста, опишите ваши симптомы

# reportsOpenError
source: Failed to open report: {error}
ru: Не удалось открыть отчёт: {error}

# chatCloseTooltip
source: Close
ru: Закрыть

# chatHint
source: Your question…
ru: Ваш вопрос…

# chatError
source: Error: {error}
ru: Ошибка: {error}

# chatDummy1
source: Hello! I'm MyScanAI. How can I help you? 😊
ru: Привет! Я MyScanAI. Чем могу помочь? 😊

# chatDummy2
source: Yes, passive smoking increases the risk of pneumonia. Inhaled toxic substances damage the airway lining and weaken local immunity, making it easier for pathogens to enter.
ru: Да, пассивное курение повышает риск развития пневмонии. Вдыхаемые токсичные вещества повреждают слизистую оболочку дыхательных путей и ослабляют местный иммунитет, что облегчает проникновение патогенов.

# diagNormalName
source: Normal
ru: Норма

# diagPneumoniaName
source: Pneumonia
ru: Пневмония

# diagCNVName
source: Choroidal neovascularization (CNV)
ru: Хориоидальная неоваскуляризация (ХНВ)

# diagDMEName
source: Diabetic macular edema (DME)
ru: Диабетический макулярный отёк (ДМО)

# diagDrusenName
source: Drusen
ru: Друзенозная дистрофия (друзены)

# diagGliomaName
source: Glioma
ru: Глиома

# diagMeningiomaName
source: Meningioma
ru: Менингиома

# diagPituitaryName
source: Pituitary adenoma
ru: Аденома гипофиза

# diagNoTumorName
source: No tumor
ru: Без опухоли
